Repository: javiercampos/NoSleepRun
Catalog: NoSleepRun/Strings.*.resx
Languages: es

# UsageString
source: Usage: nosleeprun [OPTIONS] process [args] This tool prevents Windows from sleeping or hibernating while executing command --silent silent output, do not print anything. -s|--shellexecute use ShellExecute -u|--username execute as <username> -p|--password use <password> {0} Remarks: - Username and Password cannot be used in conjunction with ShellExecute. This is a Windows restriction. {1} Report bugs to <jcl@javiercampos.info>
es: Uso: nosleeprun [OPCIONES] proceso [args] Herramienta para impedir que Windows entre en modo de suspensión o hibernación mientras se ejecuta un proceso. -x|--silent salida silenciosa, no imprimir nada -s|--shellexecute usar ShellExecute -u|--username <usuario> ejecutar proceso como <usuario> -p|--password <contraseña> usar contraseña contraseña> {0} Notas: - No se puede especificar un usuario y/o contraseña a la vez que ShellExecute. Esta es una restricción de Windows. {1} Enviar bugs a <jcl@javiercampos.info>

# ErrorNoUsernameParameter
source: error: used parameter --username without supplying a username
es: error: especificado parámetro --username sin indicar un nombre de usuario

# ErrorNoPasswordParameter
source: error: used parameter --password without supplying a password
es: error: especificado parámetro --password sin indicar una contraseña

# ErrorCantUseShellExecuteWithUsernameOrPassword
source: error: can't use --shellexecute along with a username or password
es: error: no se puede usar --shellexecute junto con un nombre de usuario o contraseña

# ProgramFinishedWithExitCodeParameter
source: process finished with exit code '{0}'
es: el proceso terminó con código de salida '{0}'

# ErrorCreatingProcessExceptionMessageParameter
source: error creating process exception message: {0}
es: error creando proceso mensaje de excepción: {0}

# ErrorInvalidParameter
source: error: unrecognized parameter: '{0}'
es: error: parametro incorrecto: '{0}'

source: error: process not specified
es: error: proceso no especificado

# Add64BitParameter
source: -64|--64bit disable syswow64 redirection
es: -64|--64bit deshabilitar redirección de syswow64

# Add64BitRemark
source: - Use the -64 switch only if you need to run a 64 bit process which needs access to 64 bit Windows system libraries
es: - Use el parámetro -64 sólo si necesita ejecutar un proceso de 64 bit que necesite acceso a las librerías de 64 bit de Windows

# WarningCouldntRevert64bitRedirection
source: warning: couldn't revert 64 bit redirection, calling thread might be unstable
es: aviso: no se pudo restablecer la redirección de 64 bit, el proceso llamante podría ser inestable

# WarningCouldntSet64bitRedirection
source: warning: couldn't disable 64 bit redirection, trying unredirected start
es: aviso: no se pudo deshabilitar la redirección de 64 bit, intentando el arranque sin redirección
